[{"Title": "NASA Prepares for Moon and Mars With New Addition to Its Deep Space Network", "Preview": "Robotic spacecraft will be able to communicate with the dish using radio waves and lasers."}, {"Title": "NASA InSight's 'Mole' Is Out of Sight", "Preview": "Now that the heat probe is just below the Martian surface, InSight's arm will scoop some additional soil on top to help it keep digging so it can take Mars' temperature."}, {"Title": "NASA's MAVEN Observes Martian Night Sky Pulsing in Ultraviolet Light", "Preview": "Vast areas of the Martian night sky pulse in ultraviolet light, according to images from NASA’s MAVEN spacecraft. The results are being used to illuminate complex circulation patterns in the Martian atmosphere."}, {"Title": "NASA's Curiosity Keeps Rolling As Team Operates Rover From Home", "Preview": "The team has learned to meet new challenges as they work remotely on the Mars mission."}, {"Title": "The Man Who Wanted to Fly on Mars", "Preview": "The Mars Helicopter is riding to the Red Planet this summer with NASA's Perseverance rover. The helicopter's chief engineer, Bob Balaram, shares the saga of how it came into being."}, {"Title": "NASA's Perseverance Rover Will Carry First Spacesuit Materials to Mars", "Preview": "In a Q&A, spacesuit designer Amy Ross explains how five samples, including a piece of helmet visor, will be tested aboard the rover, which is targeting a July 30 launch. "}, {"Title": "NASA's MAVEN Explores Mars to Understand Radio Interference at Earth", "Preview": "NASA’s MAVEN spacecraft has discovered “layers” and “rifts” in the electrically charged part of the upper atmosphere of Mars."}, {"Title": "MAVEN Maps Electric Currents around Mars that are Fundamental to Atmospheric Loss", "Preview": "Five years after NASA’s MAVEN spacecraft entered into orbit around Mars, data from the mission has led to the creation of a map of electric current systems in the Martian atmosphere."}, {"Title": "A New Video Captures the Science of NASA's Perseverance Mars Rover", "Preview": "With a targeted launch date of July 30, the next robotic scientist NASA is sending to the to the Red Planet has big ambitions."}, {"Title": "How NASA's Perseverance Mars Team Adjusted to Work in the Time of Coronavirus ", "Preview": "Like much of the rest of the world, the Mars rover team is pushing forward with its mission-critical work while putting the health and safety of their colleagues and community first."}, {"Title": "AI Is Helping Scientists Discover Fresh Craters on Mars", "Preview": "It's the first time machine learning has been used to find previously unknown craters on the Red Planet."}, {"Title": "Two Rovers to Roll on Mars Again: Curiosity and Mars 2020", "Preview": "They look like twins. But under the hood, the rover currently exploring the Red Planet and the one launching there this summer have distinct science tools and roles to play."}, {"Title": "MOXIE Could Help Future Rockets Launch Off Mars", "Preview": "NASA's Perseverance rover carries a device to convert Martian air into oxygen that, if produced on a larger scale, could be used not just for breathing, but also for fuel."}, {"Title": "NASA's MAVEN Maps Winds in the Martian Upper Atmosphere that Mirror the Terrain Below and Gives Clues to Martian Climate", "Preview": "Researchers have created the first map of wind circulation in the upper atmosphere of a planet besides Earth, using data from NASA’s MAVEN spacecraft that were collected during the last two years."}, {"Title": "3 Things We've Learned From NASA's Mars InSight ", "Preview": "Scientists are finding new mysteries since the geophysics mission landed two years ago."}]